{
  "backend/main.mo": "Motoko canister managing user profiles, predefined and custom agencies, and player agency selections with authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping game features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file.",
  "frontend/index.css": "Tailwind CSS base/theme configuration defining light and dark mode OKLCH color variables.",
  "frontend/index.html": "Basic HTML entry point loading the React app root and main script.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router routes and app-wide theming.",
  "frontend/src/components/AppLayout.tsx": "Shared layout with navigation, header/footer UI, and authentication button.",
  "frontend/src/components/AudioCaptureOrImport.tsx": "Provides UI for recording or importing audio, saving it to IndexedDB, and playing back the captured audio.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button using Internet Identity, handling authentication flow and query cache clearing.",
  "frontend/src/components/PhotoCaptureOrUpload.tsx": "Allows users to take or upload a profile photo, manages camera usage, and saves the image to IndexedDB with preview support.",
  "frontend/src/components/VideoCaptureOrUpload.tsx": "Handles video recording or uploading, displays previews, and saves the resulting video to IndexedDB.",
  "frontend/src/game/agency/predefinedAgencies.ts": "Defines a list of predefined talent agencies with names and descriptions.",
  "frontend/src/game/judging/judgeRules.ts": "Generates randomized judge feedback and scores based on performance type, difficulty, and self-rating.",
  "frontend/src/game/judging/types.ts": "Declares the JudgeFeedback interface used for structured judge scoring and tips.",
  "frontend/src/game/state/storage.ts": "Implements game state persistence in localStorage, including load, save, reset, and lightweight export functions.",
  "frontend/src/game/state/types.ts": "Defines types for game state, player profile, submissions, agencies, and judge feedback.",
  "frontend/src/game/state/useGameState.ts": "Custom hook managing game state with persistence, including profile, agency, and submission updates.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login/logout handling and exposes identity and status via React context.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for profiles, agencies, and agency selection operations.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/media/indexedDbMediaStore.ts": "Implements IndexedDB storage for saving, loading, deleting, and generating URLs for media blobs.",
  "frontend/src/media/useAudioRecorder.ts": "Provides audio recording functionality using MediaRecorder, returning recording state and the resulting file/url.",
  "frontend/src/media/useVideoRecorder.ts": "Provides video recording via MediaRecorder with preview support and recording state management.",
  "frontend/src/pages/AgencySelectionPage.tsx": "UI for selecting or creating an agency, syncing choices with backend when authenticated.",
  "frontend/src/pages/CareerModePage.tsx": "Displays the player's career overview, stats, and next challenge, redirecting to home if required data is missing.",
  "frontend/src/pages/CharacterSetupPage.tsx": "Provides a form for setting up character details, capturing photo/audio, and saving the profile before moving to the summary page.",
  "frontend/src/pages/HistoryPage.tsx": "Shows a sortable list of past performance submissions with metadata and scores, linking to individual result pages.",
  "frontend/src/pages/LandingPage.tsx": "Renders the game's landing screen with options to start a new game, continue, or reset progress.",
  "frontend/src/pages/NewGameModePage.tsx": "Lets the user choose between soloist or survival career paths and begins a new game with the selected mode.",
  "frontend/src/pages/ProfileSummaryPage.tsx": "Displays the player's profile details and saved media, advancing to agency selection if confirmed.",
  "frontend/src/pages/ResultsFeedbackPage.tsx": "Displays judge feedback for a submitted performance, showing scores, category breakdowns, and judge avatars; redirects if feedback is missing.",
  "frontend/src/pages/SettingsPage.tsx": "Shows settings for local data storage, optional cloud sync, and info about fictional judge feedback, with an option to export lightweight progress.",
  "frontend/src/pages/SubmitPerformancePage.tsx": "Lets the user record or upload a performance, set metadata, generate judge feedback, and save the submission before navigating to results.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session-based parameters, including hash-routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and plugins for the app’s UI theme.",
  "project_state.json": "Describes the project’s current state, goals, features, issues, and required assets for the offline K-pop idol game."
}